gcc -g p7final.c
îº§ gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x875: file p7final.c, line 26.
(gdb) r
Starting program: /home/runner/pps-IA1-practice-4/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p7final.c:26
26  {
(gdb) n
28    input(&c1,&c2);
(gdb) s
input (c1=0x7ffd1860c530, c2=0x7ffd1860c538) at p7final.c:10
10    printf("enter a complex no\n");
(gdb) n
enter a complex no
11    scanf("%f %f",&c1->real,&c1->imaginary);
(gdb) n
3
6
12    scanf("%f %f",&c2->real,&c2->imaginary);
(gdb) n
5
7
13  }
(gdb) p c1
$1 = (complex *) 0x7ffd1860c530
(gdb) p 
$2 = (complex *) 0x7ffd1860c530
(gdb) p *c1
$3 = {real = 3, imaginary = 6}
(gdb) p *c2
$4 = {real = 5, imaginary = 7}
(gdb) n
main () at p7final.c:29
29    c3=sum_complex(c1,c2);
(gdb) s
sum_complex (c1=..., c2=...) at p7final.c:17
17    c3.real=c1.real+c2.real;
(gdb) n
18    c3.imaginary=c1.imaginary+c2.imaginary;
(gdb) p c3.real
$5 = 8
(gdb) n
19    return c3;
(gdb) p c3.imaginary
$6 = 13
(gdb) p c3
$7 = {real = 8, imaginary = 13}
(gdb) n
20  }
(gdb) n
main () at p7final.c:30
30    output(c1,c2,c3);
(gdb) s
output (c1=..., c2=..., c3=...) at p7final.c:23
23    printf("(%f+i%f)+(%f+i%f) is (%f+i%f)\n",c1.real,c1.imaginary,c2.real,c2.imaginary,c3.real,c3.imaginary);
(gdb) n
(3.000000+i6.000000)+(5.000000+i7.000000) is (8.000000+i13.000000)
24  }
(gdb) p c1
$8 = {real = 3, imaginary = 6}
(gdb) p c2
$9 = {real = 5, imaginary = 7}
(gdb) p c3
$10 = {real = 8, imaginary = 13}
(gdb) n
main () at p7final.c:31
31    return 0;
(gdb) n
32  }(gdb) n
__libc_start_main (main=0x562a9780086d <main>, argc=1, argv=0x7ffd1860c638, 
    init=<optimized out>, fini=<optimized out>, rtld_fini=<optimized out>, 
    stack_end=0x7ffd1860c628) at ../csu/libc-start.c:344
344 ../csu/libc-start.c: No such file or directory.
(gdb) c
Continuing.
[Inferior 1 (process 225) exited normally]
(gdb) 